---------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/scott/Desktop/UNLV/ECO 772/PS4/ps4_13_10.log
  log type:  text
 opened on:   8 May 2021, 01:28:27

. 
. use JTRAIN.dta, clear

. 
. **Problem C13.10**
. 
. 
. ** question (i) **
. 
. reg hrsemp d89 grant grant_1 lemploy

      Source |       SS           df       MS      Number of obs   =       390
-------------+----------------------------------   F(4, 385)       =     33.36
       Model |  66180.5411         4  16545.1353   Prob > F        =    0.0000
    Residual |   190962.91       385  496.007559   R-squared       =    0.2574
-------------+----------------------------------   Adj R-squared   =    0.2497
       Total |  257143.451       389   661.03715   Root MSE        =    22.271

------------------------------------------------------------------------------
      hrsemp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         d89 |   6.137641   2.690089     2.28   0.023      .848536    11.42675
       grant |   31.90519   3.237857     9.85   0.000      25.5391    38.27129
     grant_1 |  -3.859016   4.474968    -0.86   0.389    -12.65745     4.93942
     lemploy |  -4.739608   1.075893    -4.41   0.000    -6.854969   -2.624247
       _cons |   25.27235   4.045454     6.25   0.000      17.3184     33.2263
------------------------------------------------------------------------------

. count if d88==1
  157

. count if d89==1
  157

. count if fcode
  471

. 
. ** question (ii) **
. 
. 
. ** question (iii) **
. 
. 
. 
. ** question (iv) **
. 
. reg hrsemp d89 grant grant_1 employ

      Source |       SS           df       MS      Number of obs   =       390
-------------+----------------------------------   F(4, 385)       =     32.30
       Model |  64613.2412         4  16153.3103   Prob > F        =    0.0000
    Residual |   192530.21       385  500.078468   R-squared       =    0.2513
-------------+----------------------------------   Adj R-squared   =    0.2435
       Total |  257143.451       389   661.03715   Root MSE        =    22.362

------------------------------------------------------------------------------
      hrsemp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         d89 |   5.845486   2.699032     2.17   0.031     .5387985    11.15217
       grant |   32.43555   3.256443     9.96   0.000     26.03291    38.83819
     grant_1 |  -3.632941   4.494748    -0.81   0.419    -12.47027    5.204385
      employ |  -.0611612   .0152359    -4.01   0.000    -.0911172   -.0312051
       _cons |    12.1299   1.693863     7.16   0.000     8.799517    15.46028
------------------------------------------------------------------------------

. 
. log cl
      name:  <unnamed>
       log:  /Users/scott/Desktop/UNLV/ECO 772/PS4/ps4_13_10.log
  log type:  text
 closed on:   8 May 2021, 01:28:28
---------------------------------------------------------------------------------------------
