---------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/scott/Desktop/UNLV/ECO 772/PS4/ps4_17_7.log
  log type:  text
 opened on:   8 May 2021, 01:02:39

. 
. 
. 
. **Problem C17.7**
. 
. 
. ** question (i) **
. reg lwage educ exper expersq nwifeinc age kidslt6 kidsge6

      Source |       SS           df       MS      Number of obs   =       428
-------------+----------------------------------   F(7, 420)       =     11.78
       Model |  36.6476796         7   5.2353828   Prob > F        =    0.0000
    Residual |  186.679761       420  .444475622   R-squared       =    0.1641
-------------+----------------------------------   Adj R-squared   =    0.1502
       Total |  223.327441       427  .523015084   Root MSE        =    .66669

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .0998844   .0150975     6.62   0.000     .0702084    .1295604
       exper |   .0407097   .0133723     3.04   0.002     .0144249    .0669946
     expersq |  -.0007473   .0004018    -1.86   0.064    -.0015371    .0000424
    nwifeinc |   .0056942   .0033195     1.72   0.087    -.0008307    .0122192
         age |  -.0035204   .0054145    -0.65   0.516    -.0141633    .0071225
     kidslt6 |  -.0558725   .0886034    -0.63   0.529    -.2300339    .1182889
     kidsge6 |  -.0176484    .027891    -0.63   0.527    -.0724718    .0371749
       _cons |  -.3579972   .3182963    -1.12   0.261    -.9836494    .2676551
------------------------------------------------------------------------------

. 
. ** question (ii) **
. heckman lwage educ exper expersq nwifeinc age kidslt6 kidsge6, select(educ exper expersq nw
> ifeinc age kidslt6 kidsge6) twostep

Heckman selection model -- two-step estimates   Number of obs     =        753
(regression model with sample selection)              Selected    =        428
                                                      Nonselected =        325

                                                Wald chi2(7)      =      53.64
                                                Prob > chi2       =     0.0000

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
lwage        |
        educ |   .1187171   .0340507     3.49   0.000      .051979    .1854553
       exper |   .0598358    .033673     1.78   0.076    -.0061621    .1258336
     expersq |  -.0010523   .0006381    -1.65   0.099     -.002303    .0001984
    nwifeinc |   .0038434   .0044919     0.86   0.392    -.0049607    .0126474
         age |   -.011158   .0134792    -0.83   0.408    -.0375767    .0152606
     kidslt6 |  -.1880451   .2308275    -0.81   0.415    -.6404586    .2643685
     kidsge6 |  -.0122255   .0296063    -0.41   0.680    -.0702527    .0458018
       _cons |  -.5602852   .4587672    -1.22   0.222    -1.459452    .3388819
-------------+----------------------------------------------------------------
select       |
        educ |   .1309047   .0252542     5.18   0.000     .0814074     .180402
       exper |   .1233476   .0187164     6.59   0.000     .0866641    .1600311
     expersq |  -.0018871      .0006    -3.15   0.002     -.003063   -.0007111
    nwifeinc |  -.0120237   .0048398    -2.48   0.013    -.0215096   -.0025378
         age |  -.0528527   .0084772    -6.23   0.000    -.0694678   -.0362376
     kidslt6 |  -.8683285   .1185223    -7.33   0.000    -1.100628    -.636029
     kidsge6 |    .036005   .0434768     0.83   0.408     -.049208    .1212179
       _cons |   .2700768    .508593     0.53   0.595    -.7267473    1.266901
-------------+----------------------------------------------------------------
/mills       |
      lambda |   .2884635   .4635617     0.62   0.534    -.6201008    1.197028
-------------+----------------------------------------------------------------
         rho |    0.41830
       sigma |  .68961378
------------------------------------------------------------------------------

. 
. ** question (iii) **
. probit inlf educ exper expersq nwifeinc age kidslt6 kidsge6

Iteration 0:   log likelihood =  -514.8732  
Iteration 1:   log likelihood = -402.06651  
Iteration 2:   log likelihood = -401.30273  
Iteration 3:   log likelihood = -401.30219  
Iteration 4:   log likelihood = -401.30219  

Probit regression                               Number of obs     =        753
                                                LR chi2(7)        =     227.14
                                                Prob > chi2       =     0.0000
Log likelihood = -401.30219                     Pseudo R2         =     0.2206

------------------------------------------------------------------------------
        inlf |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .1309047   .0252542     5.18   0.000     .0814074     .180402
       exper |   .1233476   .0187164     6.59   0.000     .0866641    .1600311
     expersq |  -.0018871      .0006    -3.15   0.002     -.003063   -.0007111
    nwifeinc |  -.0120237   .0048398    -2.48   0.013    -.0215096   -.0025378
         age |  -.0528527   .0084772    -6.23   0.000    -.0694678   -.0362376
     kidslt6 |  -.8683285   .1185223    -7.33   0.000    -1.100628    -.636029
     kidsge6 |    .036005   .0434768     0.83   0.408     -.049208    .1212179
       _cons |   .2700768    .508593     0.53   0.595    -.7267473    1.266901
------------------------------------------------------------------------------

. predict yhat, xb 

. gen imr = normalden(yhat)/normal(yhat) 

. label variable imr "inverse Mills ratio"

. 
. reg yhat educ exper expersq nwifeinc age kidslt6 kidsge6 imr

      Source |       SS           df       MS      Number of obs   =       753
-------------+----------------------------------   F(8, 744)       =         .
       Model |  507.281228         8  63.4101535   Prob > F        =         .
    Residual |           0       744           0   R-squared       =    1.0000
-------------+----------------------------------   Adj R-squared   =    1.0000
       Total |  507.281228       752  .674576101   Root MSE        =         0

------------------------------------------------------------------------------
        yhat |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .1309047          .        .       .            .           .
       exper |   .1233476          .        .       .            .           .
     expersq |  -.0018871          .        .       .            .           .
    nwifeinc |  -.0120237          .        .       .            .           .
         age |  -.0528527          .        .       .            .           .
     kidslt6 |  -.8683285          .        .       .            .           .
     kidsge6 |    .036005          .        .       .            .           .
         imr |   2.72e-08          .        .       .            .           .
       _cons |   .2700767          .        .       .            .           .
------------------------------------------------------------------------------

. 
. log cl
      name:  <unnamed>
       log:  /Users/scott/Desktop/UNLV/ECO 772/PS4/ps4_17_7.log
  log type:  text
 closed on:   8 May 2021, 01:02:40
---------------------------------------------------------------------------------------------
